# -*-enh-ruby-*-
# https://github.com/rcmdnk/homebrew-file

#
# The goal moving forward is to remove as much of these dependencies as
# possible. Specifically, my intent is to wrap all of my cloud environment
# automation within containers for optimal portability.
#

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'codeclimate/formulae'
tap 'homebrew/bundle'
tap 'homebrew/versions'
# tap 'homebrew/boneyard'
# tap 'homebrew/games'
# tap 'railwaycat/emacsmacport'

brew 'zsh'
brew 'emacs'
brew 'direnv'
brew 'gpg'
brew 'watch'
brew 'ykpers'
brew 'tree'

# mac
brew 'arduino'
brew 'atom'
brew 'betterzipql'
brew 'dropbox'
brew 'emacs'
brew 'firefox'
brew 'iterm2'
brew 'launchcontrol'
brew 'transmission'
brew 'tuntap'
brew 'xquartz'

# quicklook
brew 'qlcolorcode'
brew 'qlmarkdown'
brew 'qlprettypatch'
brew 'qlstephen'
brew 'quicklook-csv'
brew 'quicklook-json'
brew 'suspicious-package'
brew 'webp-quicklook'

# ops
brew 'chefdk'
#brew 'consul'
#brew 'consul-template'
#brew 'coreos-osx-gui'
brew 'packer'
brew 'serf'
brew 'terraform'
brew 'vagrant'
brew 'vault'
brew 'virtualbox'
